// Задача 1. Вывести квадрат числа
Console.WriteLine("Введите число: ");
// Конвертируем строку в число
int numberValue = Convert.ToInt32(Console.ReadLine());
int result = numberValue*numberValue;
Console.WriteLine(result);